import React from "react";
import Pagination from "../Pagination";

const Main = function() {
    return (
        <main>
            <div className="module-banner">
                <div className="banner-text active">
                    <h2>Карта рынка труда России 1</h2>
                    <p>
                        Интернет-проект, объединяющий в рамках одного портала все самые необходимые соискателю ресурсы
                        по поиску работы и предоставляющий прямой доступ к лучшим компаниям-работодателям, кадровым
                        агентствам, сайтам по поиску работы, ярмаркам вакансий, газетам и журналам по карьере в любом
                        городе России.
                    </p>
                    <p>
                        Интернет-проект, объединяющий в рамках одного портала все самые необходимые соискателю ресурсы
                        по поиску работы и предоставляющий прямой доступ к лучшим компаниям-работодателям, кадровым
                        агентствам, сайтам по поиску работы, ярмаркам вакансий, газетам и журналам по карьере в любом
                        городе России.
                    </p>
                </div>

                <div className="banner-text">
                    <h2>Карта рынка труда России 2</h2>
                    <p>
                        Интернет-проект, объединяющий в рамках одного портала все самые необходимые соискателю ресурсы
                        по поиску работы и предоставляющий прямой доступ к лучшим компаниям-работодателям, кадровым
                        агентствам, сайтам по поиску работы, ярмаркам вакансий, газетам и журналам по карьере в любом
                        городе России.
                    </p>
                    <p>
                        Интернет-проект, объединяющий в рамках одного портала все самые необходимые соискателю ресурсы
                        по поиску работы и предоставляющий прямой доступ к лучшим компаниям-работодателям, кадровым
                        агентствам, сайтам по поиску работы, ярмаркам вакансий, газетам и журналам по карьере в любом
                        городе России.
                    </p>
                </div>

                <div className="banner-text">
                    <h2>Карта рынка труда России 3</h2>
                    <p>
                        Интернет-проект, объединяющий в рамках одного портала все самые необходимые соискателю ресурсы
                        по поиску работы и предоставляющий прямой доступ к лучшим компаниям-работодателям, кадровым
                        агентствам, сайтам по поиску работы, ярмаркам вакансий, газетам и журналам по карьере в любом
                        городе России.
                    </p>
                    <p>
                        Интернет-проект, объединяющий в рамках одного портала все самые необходимые соискателю ресурсы
                        по поиску работы и предоставляющий прямой доступ к лучшим компаниям-работодателям, кадровым
                        агентствам, сайтам по поиску работы, ярмаркам вакансий, газетам и журналам по карьере в любом
                        городе России.
                    </p>
                </div>

                <div className="banner-text">
                    <h2>Карта рынка труда России 4</h2>
                    <p>
                        Интернет-проект, объединяющий в рамках одного портала все самые необходимые соискателю ресурсы
                        по поиску работы и предоставляющий прямой доступ к лучшим компаниям-работодателям, кадровым
                        агентствам, сайтам по поиску работы, ярмаркам вакансий, газетам и журналам по карьере в любом
                        городе России.
                    </p>
                    <p>
                        Интернет-проект, объединяющий в рамках одного портала все самые необходимые соискателю ресурсы
                        по поиску работы и предоставляющий прямой доступ к лучшим компаниям-работодателям, кадровым
                        агентствам, сайтам по поиску работы, ярмаркам вакансий, газетам и журналам по карьере в любом
                        городе России.
                    </p>
                </div>

                <div className="banner-text">
                    <h2>Карта рынка труда России 5</h2>
                    <p>
                        Интернет-проект, объединяющий в рамках одного портала все самые необходимые соискателю ресурсы
                        по поиску работы и предоставляющий прямой доступ к лучшим компаниям-работодателям, кадровым
                        агентствам, сайтам по поиску работы, ярмаркам вакансий, газетам и журналам по карьере в любом
                        городе России.
                    </p>
                    <p>
                        Интернет-проект, объединяющий в рамках одного портала все самые необходимые соискателю ресурсы
                        по поиску работы и предоставляющий прямой доступ к лучшим компаниям-работодателям, кадровым
                        агентствам, сайтам по поиску работы, ярмаркам вакансий, газетам и журналам по карьере в любом
                        городе России.
                    </p>
                </div>

                <Pagination />

                <button className="toggle"></button>

                <button className="previous previous-banner" type="button"></button>

                <button className="next next-banner" type="button"></button>
            </div>

            <div className="module-sheet"></div>
        </main>
    );
};

export default Main;